# DeleteWallPeak

## Description
Deletes the wall peak at the given index number

```pascal
PROCEDURE DeleteWallPeak(
				wallHandle : HANDLE;
				index      : INTEGER);
```

```python
def vs.DeleteWallPeak(wallHandle, index):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHandle|HANDLE|   |
|index|INTEGER|   |

## Version
Availability: from Vectorworks 2014

## Category
* Objects - Walls